<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>上海pois</title>
    <style type="text/css">
        .img {width: 20px;height: 20px;opacity: 1;position: absolute;z-index: 100000;transition: 2s;}
  .left,.right {width: 10px;height: 10px;border-radius: 100%;position: absolute;}
  .right {right: 0;}
  .under {width: 10px;height: 10px;position: absolute;top: 5px;left: 5px;transform: rotate(45deg)}
  .text {width: 50px;font-size: 10px;line-height: 1;position: absolute;top: -1em;left: -15px;text-align: center;}

        #viz {
            width: 90%;
            height: calc(100% - 130px);
            border: 1px solid lightgray;
            font: 22pt arial;
            margin: 0 auto;
        }
        html,body{
            width: 100%;
            height: 100%;
        }
        html,body,div{
            margin: 0;
            padding: 0;
        }
        .title{
            height: 120px;
            font-size: 25px;

        }
        .title>:nth-child(1){
            height: 70px;
            line-height: 110px;
            padding-left: 150px;
        }
        .title>:nth-child(1)>span:nth-child(1){
            font-weight: bold;
            color: #2b9beb;
        }
        .title>:nth-child(2){
            height: 10px;
            padding-left: 200px;
            font-size: 15px;
            font-style:italic
        }
        .container{
            height: calc(100% - 120px);
        }
        .container .search{
            width: 600px;
            height: 50px;
            background: aliceblue;
            position: fixed;
            right: 5%;
            display: flex;
            justify-content: center;
            align-items: center;
            box-shadow: 3px 3px 5px 5px #ccc;
            top: 40px;
        }
        .container .search input{
            width: 500px;
        }
        .neo-container {
            justify-content: center;
        }
        .container .cypher{
            width: 90%;
            margin: 0 auto;
        }
    </style>
    <script src="./lib/jquery-3.6.0.min.js"></script>
    <script src="./lib/neovis.js"></script>
</head>

<body>
    <div class="title">
        <div><span>NEO4J - </span>&nbsp;&nbsp;<span>POIS</span></div>
        <div>上海市区加油站、充电桩poi数据知识图谱图形化展示</div>
    </div>
    <div class="container">
        <div class="search">
            <input class="query_by_cql" type="text" placeholder="请输入cypher语句进行查询，例如：MATCH p = (n)-[r:Belongto]->(m) RETURN p limit 10" >&nbsp;&nbsp;
            <button id="btn_submit">搜索</button>
        </div>
        <div id="viz">

        </div>
        <div class="cypher">
            <h4>常用查询语句</h4>
            <ul>
                <li><span>查询上海市和行政区：</span>MATCH p = (:Qu)-[:Belongto]->(:Shi) RETURN p</li>
                <li><span>查询浦东新区下的300个poi：</span>MATCH p = (n)-[:Belongto]->(:Qu{name:"浦东新区"}) RETURN p limit 300</li>
                <li><span>查询特斯拉充电桩：</span>MATCH (c:Chongdianzhuang) where c.name =~ '.*特斯拉.*' RETURN c</li>
            </ul>
        </div>
    </div>
</body>
<script>
    $(function () {
        var viz;
        var config = {
            container_id: "viz",
            server_url: "bolt://localhost:7687",
            server_user: "neo4j",
            server_password: "123",
            arrows: false,
            labels: {
                "Shi": {
                    "caption": "name",
                    "size": 20,
                    "community": "name",
                    // "image": 'https://visjs.org/images/visjs_logo.png',
                    "font": {
                        "size": 26,
                        "color": "#000000"
                    },
                    // "title_properties": [
                    //     "name"
                    // ],
                },
                "Qu": {
                    "caption": "name",
                    "size": 18,
                    "community": "name",
                    "font": {
                        "size": 24,
                        "color": "#000000"
                    },
                    // "title_properties": [
                    //     "name"
                    // ],
                },
                "Jiayouzhan": {
                    "caption": "name",
                    "size": 16,
                    "community": "name",
                    "font": {
                        "size": 20,
                        "color": "#000000"
                    },
                },
                "Chongdianzhuang": {
                    "caption": "name",
                    "size": 16,
                    "community": "name",
                    "font": {
                        "size": 20,
                        "color": "#000000"
                    },
                },
            },
            relationships: {
                "Belongto": {
                    "thickness": "weight",
                    // "caption": '属于',
                    "caption": false,
                },
            },
            initial_cypher: "MATCH p = (n)-[:Belongto]->(m) RETURN p limit 300"
        };

        viz = new NeoVis.default(config);
        viz.render();
        $("#btn_submit").click(function (e) {
            e.preventDefault();
            const cql = $('.query_by_cql').val();
            console.log(cql)
            config['initial_cypher'] = ($.trim(cql) === '') ? "MATCH p = (n)-[]->(m) RETURN p limit 50" : cql;
            try {
                viz.clearNetwork()
                viz.reinit(config)
                viz.render()
            } catch (err) {
                alert('cypher语句有误，请检查')
            }
        });
        $(".btn_submit_byname1").click(function (e) {
            e.preventDefault();
            const name = $('.query_by_name1').val();
            console.log(name)
            config['initial_cypher'] = ($.trim(name) === '') ? "MATCH (n)-[r:R]->(m) RETURN * limit 50" : "match p = (n)-[*1..3]->(m) where m.name =~ '.*" + name + ".*' return p";
            try {
                viz.clearNetwork()
                viz.reinit(config)
                viz.render()
            } catch (err) {
                alert('cypher语句有误，请检查')
            }
        });
        $(".btn_submit_byname2").click(function (e) {
            e.preventDefault();
            const name = $('.query_by_name2').val();
            console.log(name)
            config['initial_cypher'] = ($.trim(name) === '') ? "MATCH (n)-[r:R]->(m) RETURN * limit 50" : "match p = (n)-[*1..3]->(m) where n.name =~ '.*" + name + ".*' return p";
            try {
                viz.clearNetwork()
                viz.reinit(config)
                viz.render()
            } catch (err) {
                alert('cypher语句有误，请检查')
            }
        });
        $(".btn_close").click(function (e) {
            e.preventDefault();
            viz.clearNetwork()
        });

    })
</script>
<script src="./lib/xingxing.js"></script>
</html>